In [2]:
import pandas as pd
import numpy as py
from sklearn import linear_model

In [3]:
df=pd.read_csv(r"C:\Users\ASUS\OneDrive\Desktop\ML\multi.csv")

In [4]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
df.experience=df.experience.fillna('zero')

In [8]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
df.rename(columns={'test_score(out of 10)':'testscore'},inplace=True)

In [11]:
df.rename(columns={'interview_score(out of 10)':'interscore'},inplace=True)

In [13]:
m=df.testscore.median()

In [16]:
df.testscore=df.testscore.fillna(m)

In [17]:
df.testscore

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: testscore, dtype: float64

In [21]:
pip install word2number

Collecting word2numberNote: you may need to restart the kernel to use updated packages.
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5583 sha256=85bb814336a5b15ad3fdbd16bb13c6e80c931a3a5417658170d6cfa5ea6902fe
  Stored in directory: c:\users\asus\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [22]:
from word2number import w2n

In [24]:
w2n.word_to_num('five')

5

In [26]:
df.experience=df.experience.apply(w2n.word_to_num)

In [27]:
df

   experience  testscore  interscore  salary($)
0           0        8.0           9      50000
1           0        8.0           6      45000
2           5        6.0           7      60000
3           2       10.0          10      65000
4           7        9.0           6      70000
5           3        7.0          10      62000
6          10        8.0           7      72000
7          11        7.0           8      80000

In [30]:
reg=linear_model.LinearRegression()

In [32]:
reg

LinearRegression()

In [34]:
df.rename(columns={'salary($)':'salary'},inplace=True)

In [44]:
newdf=df.drop(['salary'],axis='columns')

In [46]:
newdf

   experience  testscore  interscore
0           0        8.0           9
1           0        8.0           6
2           5        6.0           7
3           2       10.0          10
4           7        9.0           6
5           3        7.0          10
6          10        8.0           7
7          11        7.0           8

In [47]:
reg.fit(newdf,df.salary)

LinearRegression()

In [48]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [49]:
reg.intercept_

17737.263464337688

In [50]:
reg.predict([[2,9,6]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])